"USSD_ERROR" = "Virhe suoritettaessa pyyntöä";
"USSD_TERMINATED" = "Istunto lopetettu";

"%@ Call Forwarding\n%@\n%@%@" = "%@ Soitonsiirto\n%@\n%@%@";
"%@ Call Waiting\n%@" = "%@ Koputus\n%@";
"%@ Call Barring\n%@\n%@" = "%@ Estetyt puhelut\n%@\n%@";
"%@ Fixed Dialing\n%@" = "%@ Puhelunesto\n%@";
"Connected Line Presentation\n%@" = "Vastaanottavan numeron\nilmaisu %@";
"Calling Line Presentation\n%@" = "Soittavan numeron ilmaisu\n%@";
"Connected Line ID Restriction\n%@" = "Vastaanottavan numeron\ntunnistuksen esto %@";
"Calling Line ID Restriction\n%@" = "Soittavan numeron tunnistuksen rajoitus\n%@";
"SIM Lock\n%@" = "SIM-lukko\n%@";
"Service Center Address\n%@" = "Palvelukeskuksen osoite\n%@";
"Supplementary Service Password\n%@" = "Lisäpalvelun salasana\n%@";
"Calling Name Presentation\n%@" = "Soittavan nimen ilmaisu\n%@";

"Forwards to %@\n" = "Siirto numeroon %@\n";

"All Calls" = "Kaikki puhelut";
"All Conditional Calls" = "Kaikki ehdolliset puhelut";
"Async Data Circuit" = "Asynkroninen tietopiiri";
"Data" = "Data";
"Fax" = "Faksi";
"Packet Access" = "Packet Access";
"Pad Access" = "PAD Access";
"SMS" = "Tekstiviesti";
"Sync Data Circuit" = "Synkroninen tietopiiri";
"Voice" = "Puheääni";

"All Outgoing" = "Kaikki lähtevät";
"All Incoming" = "Kaikki saapuvat";
"Outgoing International" = "Lähtevät ulkomaanpuhelut";
"Outgoing International, Except Home Country" = "Lähtevät ulkomaanpuhelut, paitsi kotimaa";
"Incoming While Roaming Outside Home Country" = "Saapuvat verkkovierailussa ulkomailla";
"Incoming, Not On SIM" = "Saapuvat, ei SIMillä";
"All Services" = "Kaikki palvelut";
"All Outgoing Services" = "Kaikki lähtevät palvelut";
"All Incoming Services" = "Kaikki saapuvat palvelut";

"Disabled" = "Ei käytössä";
"Enabled" = "Käytössä";

"On All Calls" = "Kaikille puheluille";
"When Busy" = "Kun varattu";
"When Unanswered" = "Kun ei vastata";
"When Unreachable" = "Kun ei tavoiteta";

"Setting %@ Succeeded" = "%@ onnistui\n";
"Setting Interrogation Succeeded" = "Asetuksen kysely onnistui\n";
"Setting %@ Failed" = "%@ epäonnistui\n";
"Setting Interrogation Failed" = "Asetuksen kysely epäonnistui\n";

"Not Available" = "Ei käytettävissä";
"Network Controlled" = "Verkko-ohjattu";
"Temporarily Disabled" = "Väliaikaisesti pois käytöstä";
"Temporarily Enabled" = "Väliaikaisesti käytössä";
"Unknown" = "Tuntematon";

"Activation" = "Käyttöönotto";
"Deactivation" = "Käytöstäpoisto";
"Interrogation" = "Kysely";
"Registration" = "Rekisteröinti";
"Erasure" = "Häviö";

"No Address" = "Ei osoitetta";
"No Service Specified" = "Ei valittua palvelua";
"Type %d" = "Tyyppi %d";

// generic error
"CALL_FAILED" = "Puhelu epäonnistui";
// error codes
"kCTNoError" = "Ei virhettä";
"kCTUnknownError" = "Tuntematon virhe";
"kCTErrorRadioFailure" = "Radiotaajuusvirhe";
// Generic network errors
"kCTErrorNetworkFailure" = "Verkkovirhe";
"kCTErrorCongestion" = "Verkko ruuhkautunut";
"kCTErrorUnidentifiedSubscriber" = "Tunnistamaton tilaaja";
"kCTErrorFacilityRejected" = "Laitos hylätty";
"kCTErrorUnknownSubscriber" = "Tuntematon tilaaja";
"kCTErrorNetworkOutOfOrder" = "Verkko ei toiminnassa";
"kCTErrorInvalidTransactionIdentifier" = "Virheellinen siirtotunniste";
"kCTErrorSemanticallyIncorrectMessage" = "Semanttisesti virheellinen viesti";
"kCTErrorInvalidMandatoryInformation" = "Virheellinen pakollinen tieto";
"kCTErrorMessageTypeNonExistant" = "Viestin tyyppiä ei ole olemassa";
"kCTErrorMessageNotCompatibleWithProtocolState" = "Viesti ei ole yhteensopiva protokollan tilan kanssa";
"kCTErrorInformationElementNonExistant" = "Tietoelementtiä ei ole olemassa";
"kCTErrorProtocolErrorUnspecified" = "Protokollavirhe määrittämätön";
"kCTErrorTemporaryFailure" = "Tilapäinen virhe";
"kCTErrorResourcesUnavailable" = "Resurssit ei käytettävissä";
"kCTErrorRequestedFacilityNotSubscribed" = "Pyydettyä toimintoa ei ole tilattu";
"kCTErrorRequestedFacilityNotImplemented" = "Pyydettyä toimintoa ei ole toteutettu";
"kCTErrorInterworkingError" = "Yhteistoimintavirhe";
"kCTErrorInterworkingNotSupported" = "Yhteistoimintaa ei tueta";
"kCTErrorCommandCannotBeActioned" = "Komentoa ei voida toteuttaa";
"kCTErrorNoNetworkService" = "Ei verkkopalvelua";
// Call related errors
"kCTErrorUnassignedNumber" = "Numero ei käytössä";
"kCTErrorOperatorDeterminedBarring" = "Operaattorin toteuttama puhelunesto";
"kCTErrorCallBarred" = "Puhelu estetty";
"kCTErrorUserBusy" = "Käyttäjä varattu";
"kCTErrorNoUserResponding" = "Kukaan ei vastaa";
"kCTErrorNumberChanged" = "Numero vaihtunut";
"kCTErrorInvalidNumberFormat" = "Virheellinen numeromuoto";
"kCTErrorCallRejected" = "Puhelu hylätty";
// SIM errors
"kCTErrorSimNotInserted" = "SIM-kortti puuttuu";
"kCTErrorSimPinRequired" = "Tarvitaan SIM-kortin PIN";
"kCTErrorSimPukRequired" = "Tarvitaan SIM-kortin PUK-koodi";
"kCTErrorSimFailure" = "SIM-kortin virhe";
"kCTErrorSimMemoryFailure" = "SIM-kortin muistivirhe";
"kCTBadPinFormatError" = "Väärä PIN-muoto";
"kCTErrorNumberNotAllowed" = "Numero ei sallittu";
"kCTErrorIncorrectPassword" = "Väärä salasana";
// SMS Errors
"kCTErrorShortMessageTransferRejected" = "Tekstiviestin lähetys hylättiin";
"kCTErrorDestinationOutOfOrder" = "Vastaanottaja ei toiminnassa";
"kCTErrorClass0NotSupported" = "Luokkaa 0 ei tueta";
"kCTErrorCannotReplaceSm" = "SIM-korttia ei voida korvata";
"kCTErrorUnspecifiedPid" = "Tuntematon PID";
"kCTErrorDataCodingSchemeNotSupported" = "Datan koodaustapaa ei tueta";
"kCTErrorUnspecifiedDcs" = "Tuntematon DCS-virhe";
"kCTErrorCommandUnsupported" = "Komentoa ei tueta";
"kCTErrorUnspecifiedTpCommand" = "Tuntematon TP-komentovirhe";
"kCTErrorTpduNotSupported" = "TPDU:ta ei tueta";
"kCTErrorScBusy" = "SC varattu";
"kCTErrorRejectedBySimSmsControl" = "SIMin SMS-ohjaimen hylkäämä";
// GPRS Errors
"kCTErrorGprsIllegalMs" = "GPRS laiton MS";
"kCTErrorGprsIllegalMe" = "GPRS laiton ME";
"kCTErrorGprsServicesNotAllowed" = "GPRS-palvelut eivät ole sallittuja";
"kCTErrorGprsPlmnNotAllowed" = "GPRS PLMN ei sallittu";
"kCTErrorGprsLocationAreaNotAllowed" = "GPRS-sijaintialue ei sallittu";
"kCTErrorGprsRoamingNotAllowedInLocationArea" = "GPRS-verkkovierailu ei sallittu tällä alueella";
"kCTErrorGprsServiceOptionNotSupported" = "Valittua GPRS-palvelua ei tueta";
"kCTErrorGprsServiceOptionNotSubscribed" = "Valittua GPRS-palvelua ei ole tilattu";
"kCTErrorGprsServiceOptionTemporarilyOutOfOrder" = "Valittu GPRS-palvelu tilapäisesti pois käytöstä";
"kCTErrorGprsPdpAuthenticationFailure" = "GPRS PDP -todentamisvirhe";
"kCTErrorGprsInvalidMobileClass" = "GPRS virheellinen mobiililuokka";
"kCTErrorGprsUnspecified" = "GPRS ei määritetty";
"kCTErrorGprsMissingorUnknownAPN" = "GPRS puuttuu tai tuntematon APN";
"kCTErrorGprsPDPAuthenticationInfoRejectedByBaseband" = "Peruskaista hylkäsi GPRS PDP -todennustiedot";
